Tekla Open API Reference for Tekla Structures 2025
FormBorders.CheckScreenPosition Method
Overload List
Name | Description
CheckScreenPosition(Form)
 Moves form to primary screen.
CheckScreenPosition(Window)
 Moves window to primary screen.
Top
See Also
Reference
FormBorders Class
Tekla.Structures.Dialog Namespace